status/2021/26nov21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>20 November 2021 - 26 November 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">20 November 2021 - 26 November 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf4ee1dc">1. MIT OCW</a>
<ul>
<li><a href="#org761cce6">1.1. 18.01 - Single Variable Calculus</a>
<ul>
<li><a href="#org7fd1870">1.1.1. Sessions 74-76</a></li>
</ul>
</li>
<li><a href="#org10026d0">1.2. 8.01X - Physics I - Classical Mechanics with Labs</a></li>
</ul>
</li>
<li><a href="#org2cf2455">2. LA County index map</a></li>
<li><a href="#org0d57ec3">3. Mill Controller #2</a></li>
<li><a href="#org88ab9c3">4. WWVB Decoder</a></li>
<li><a href="#org0a4b80d">5. Santa Cruz Weather Station</a></li>
<li><a href="#org7957d31">6. Marble Computation</a>
<ul>
<li><a href="#org27e186d">6.1. Next Steps</a>
<ul>
<li><a href="#org28ac0b1">6.1.1. Continue Reversible Computation Study</a></li>
<li><a href="#org521c828">6.1.2. Prototype Marble inverter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf24d3a8">7. ca-r</a>
<ul>
<li><a href="#orgda33940">7.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org075a6cf">8. us-index-map</a>
<ul>
<li><a href="#org384dd70">8.1. error analysis</a></li>
</ul>
</li>
<li><a href="#org66599c4">9. Sun Ultra 10</a>
<ul>
<li><a href="#orgcc953aa">9.1. Next steps</a>
<ul>
<li><a href="#org3845167">9.1.1. Serial debug</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf68c1fd">10. Apple iMac G4</a>
<ul>
<li><a href="#org3375ceb">10.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orgc292ea1">11. Davies Brothel</a>
<ul>
<li><a href="#org31ce142">11.1. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org67e7e31">11.2. Next hearing 14jan2022. Still no PACER.</a></li>
</ul>
</li>
<li><a href="#org8b7f1ca">12. Peter Kim</a>
<ul>
<li><a href="#org35b91e7">12.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org3758603">12.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#orgabd823e">12.3. Next hearing: 1/31/2022 01:30 PM</a></li>
</ul>
</li>
<li><a href="#org8de1ee1">13. Linux Audio</a>
<ul>
<li><a href="#org3adba0e">13.1. pvanal to spectrogram</a>
<ul>
<li><a href="#org5f12f52">13.1.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orgae7090d">13.2. CSound programming.</a>
<ul>
<li><a href="#org11a79f7">13.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#orgb84179c">13.3. Faust programming</a>
<ul>
<li><a href="#orgc94ffc1">13.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org85bc0ef">14. EPICS</a>
<ul>
<li><a href="#orgbba7643">14.1. Next steps</a>
<ul>
<li><a href="#orgbec0306">14.1.1. Started CGR-101 SCPI interface</a></li>
<li><a href="#org847e0c5">14.1.2. u3scpi network port testing</a></li>
<li><a href="#org3aa47d9">14.1.3. initial EPICS interface</a></li>
<li><a href="#orgd8088c5">14.1.4. u3scpi analog/digital port reconfiguration.</a></li>
<li><a href="#org610dbe6">14.1.5. u3scpi 'DIGITIZER' subsystem.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf4408a6">15. Brini Tracker II</a>
<ul>
<li><a href="#org6fa1149">15.1. Next steps</a>
<ul>
<li><a href="#org023632f">15.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#orga3c37fe">15.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org974fc0f">15.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0e3adb1">16. wktcolor</a>
<ul>
<li><a href="#orga2694c0">16.1. Next steps</a>
<ul>
<li><a href="#org1390c65">16.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9447e22">17. wktplot</a>
<ul>
<li><a href="#orgbd31bda">17.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orgf1a7093">18. AMDGPU</a>
<ul>
<li><a href="#org0fd0a5b">18.1. Next step</a>
<ul>
<li><a href="#orgd8e136f">18.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgadf07f0">19. Ninja v Make</a>
<ul>
<li><a href="#orga26d264">19.1. Next Step</a>
<ul>
<li><a href="#orgcbd04ad">19.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgffe5c45">20. GMP Forth</a>
<ul>
<li><a href="#orgde4270d">20.1. Need to think about adding floating point support</a></li>
<li><a href="#org22fb215">20.2. Port to non-Linux OS</a></li>
</ul>
</li>
<li><a href="#orge425cd4">21. Swocer</a>
<ul>
<li><a href="#orgd9980fa">21.1. Most crashing addressed</a></li>
<li><a href="#org5028227">21.2. Added outline for 'bottle' test</a></li>
<li><a href="#orgdd819a7">21.3. Next steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Giving Thanks
</p>

<div id="outline-container-orgf4ee1dc" class="outline-2">
<h2 id="orgf4ee1dc"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org761cce6" class="outline-3">
<h3 id="org761cce6"><span class="section-number-3">1.1.</span> 18.01 - Single Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org7fd1870" class="outline-4">
<h4 id="org7fd1870"><span class="section-number-4">1.1.1.</span> Sessions 74-76</h4>
</div>
</div>
<div id="outline-container-org10026d0" class="outline-3">
<h3 id="org10026d0"><span class="section-number-3">1.2.</span> 8.01X - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Planning lab materials along with 8.02X (Electricity and Magnetism)
</p>
</div>
</div>
</div>
<div id="outline-container-org2cf2455" class="outline-2">
<h2 id="org2cf2455"><span class="section-number-2">2.</span> LA County index map</h2>
<div class="outline-text-2" id="text-2">
<p>
Various updates including county boundary.
<a href="https://github.com/daniel-kelley/la-ca-6min-index">https://github.com/daniel-kelley/la-ca-6min-index</a>
</p>
</div>
</div>
<div id="outline-container-org0d57ec3" class="outline-2">
<h2 id="org0d57ec3"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
<p>
Planning mill controller upgrade for 2022. Working concept is MachineKit
on BeagleBoard Black. Probably will design own IO board for 5V I/O unless
I can find something that's less expensive than what I can build.
</p>
</div>
</div>
<div id="outline-container-org88ab9c3" class="outline-2">
<h2 id="org88ab9c3"><span class="section-number-2">4.</span> WWVB Decoder</h2>
<div class="outline-text-2" id="text-4">
<p>
Prototyped Clock sync PLL. Works against clean waveforms, fails against
actual waveforms. Need to think about de-noising.
</p>
</div>
</div>
<div id="outline-container-org0a4b80d" class="outline-2">
<h2 id="org0a4b80d"><span class="section-number-2">5.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-5">
<p>
Rain Gauge still working.
</p>
</div>
</div>
<div id="outline-container-org7957d31" class="outline-2">
<h2 id="org7957d31"><span class="section-number-2">6.</span> Marble Computation</h2>
<div class="outline-text-2" id="text-6">
<p>
Collected materials (thin copper plate, copper PCB blanks) for prototyping.
</p>
</div>
<div id="outline-container-org27e186d" class="outline-3">
<h3 id="org27e186d"><span class="section-number-3">6.1.</span> Next Steps</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org28ac0b1" class="outline-4">
<h4 id="org28ac0b1"><span class="section-number-4">6.1.1.</span> Continue Reversible Computation Study</h4>
</div>
<div id="outline-container-org521c828" class="outline-4">
<h4 id="org521c828"><span class="section-number-4">6.1.2.</span> Prototype Marble inverter</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
Using dual rail differential logic (left/,right/1), an inverter
merely switches sides. Now thinking an over-center spring controlling
a 'side gate' controlled by a pair of sense levers.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf24d3a8" class="outline-2">
<h2 id="orgf24d3a8"><span class="section-number-2">7.</span> ca-r</h2>
<div class="outline-text-2" id="text-7">
<p>
Issue #33 seems to have fixed itself.
</p>
</div>
<div id="outline-container-orgda33940" class="outline-3">
<h3 id="orgda33940"><span class="section-number-3">7.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Wait for further breakage.
</p>
</div>
</div>
</div>
<div id="outline-container-org075a6cf" class="outline-2">
<h2 id="org075a6cf"><span class="section-number-2">8.</span> us-index-map</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org384dd70" class="outline-3">
<h3 id="org384dd70"><span class="section-number-3">8.1.</span> error analysis</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Started an error analysis on the USGS topomaps<sub>all.csv</sub> index file. Nothing obvious pops up,
and the error reported by Maureen would be impossible to catch anyway.
</p>
</div>
</div>
</div>
<div id="outline-container-org66599c4" class="outline-2">
<h2 id="org66599c4"><span class="section-number-2">9.</span> Sun Ultra 10</h2>
<div class="outline-text-2" id="text-9">
<p>
Trying to see what state it is in. Fires up but no video. Need DB25M to
debug over serial port.
</p>
</div>
<div id="outline-container-orgcc953aa" class="outline-3">
<h3 id="orgcc953aa"><span class="section-number-3">9.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org3845167" class="outline-4">
<h4 id="org3845167"><span class="section-number-4">9.1.1.</span> Serial debug</h4>
</div>
</div>
</div>
<div id="outline-container-orgf68c1fd" class="outline-2">
<h2 id="orgf68c1fd"><span class="section-number-2">10.</span> Apple iMac G4</h2>
<div class="outline-text-2" id="text-10">
<p>
Building userland may be a PITA due to lack of RAM. Build would often
segfault.
</p>
</div>
<div id="outline-container-org3375ceb" class="outline-3">
<h3 id="org3375ceb"><span class="section-number-3">10.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Not sure.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc292ea1" class="outline-2">
<h2 id="orgc292ea1"><span class="section-number-2">11.</span> Davies Brothel</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org31ce142" class="outline-3">
<h3 id="org31ce142"><span class="section-number-3">11.1.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org67e7e31" class="outline-3">
<h3 id="org67e7e31"><span class="section-number-3">11.2.</span> Next hearing 14jan2022. Still no PACER.</h3>
</div>
</div>
<div id="outline-container-org8b7f1ca" class="outline-2">
<h2 id="org8b7f1ca"><span class="section-number-2">12.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org35b91e7" class="outline-3">
<h3 id="org35b91e7"><span class="section-number-3">12.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org3758603" class="outline-3">
<h3 id="org3758603"><span class="section-number-3">12.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-orgabd823e" class="outline-3">
<h3 id="orgabd823e"><span class="section-number-3">12.3.</span> Next hearing: 1/31/2022 01:30 PM</h3>
</div>
</div>
<div id="outline-container-org8de1ee1" class="outline-2">
<h2 id="org8de1ee1"><span class="section-number-2">13.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org3adba0e" class="outline-3">
<h3 id="org3adba0e"><span class="section-number-3">13.1.</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Enough of libriffr and libpvocf work to start pvoctool
<a href="https://github.com/daniel-kelley/pvoctool">https://github.com/daniel-kelley/pvoctool</a>. Have HDF5 output and
text delimited output for octave. Can import PVOC data to octave
spectrogram for display.
</p>
</div>
<div id="outline-container-org5f12f52" class="outline-4">
<h4 id="org5f12f52"><span class="section-number-4">13.1.1.</span> Next steps</h4>
<div class="outline-text-4" id="text-13-1-1">
<p>
Loop analysis
</p>
</div>
</div>
</div>
<div id="outline-container-orgae7090d" class="outline-3">
<h3 id="orgae7090d"><span class="section-number-3">13.2.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-13-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-org11a79f7" class="outline-4">
<h4 id="org11a79f7"><span class="section-number-4">13.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-13-2-1">
</div>
<ol class="org-ol">
<li><a id="orgda946bd"></a>loscil demo<br /></li>
<li><a id="org11e8b00"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgb84179c" class="outline-3">
<h3 id="orgb84179c"><span class="section-number-3">13.3.</span> Faust programming</h3>
<div class="outline-text-3" id="text-13-3">
</div>
<div id="outline-container-orgc94ffc1" class="outline-4">
<h4 id="orgc94ffc1"><span class="section-number-4">13.3.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-13-3-1">
</div>
<ol class="org-ol">
<li><a id="org2cf8027"></a>GAC Patch save/restore<br /></li>
<li><a id="orga19fa72"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-13-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="org84faa1a"></a>OSC control surface<br />
<div class="outline-text-5" id="text-13-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="orgca88938"></a>Faust/csound<br />
<div class="outline-text-5" id="text-13-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org85bc0ef" class="outline-2">
<h2 id="org85bc0ef"><span class="section-number-2">14.</span> EPICS</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orgbba7643" class="outline-3">
<h3 id="orgbba7643"><span class="section-number-3">14.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-orgbec0306" class="outline-4">
<h4 id="orgbec0306"><span class="section-number-4">14.1.1.</span> Started CGR-101 SCPI interface</h4>
<div class="outline-text-4" id="text-14-1-1">
</div>
<ol class="org-ol">
<li><a id="org18d3356"></a>Will help test u3scpi<br /></li>
<li><a id="orgb49dbd9"></a>Using flex/bison SCPI parser<br />
<div class="outline-text-5" id="text-14-1-1-2">
<p>
100% system commands done.
Planning 'DIGITIZER' subsystem.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org847e0c5" class="outline-4">
<h4 id="org847e0c5"><span class="section-number-4">14.1.2.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org3aa47d9" class="outline-4">
<h4 id="org3aa47d9"><span class="section-number-4">14.1.3.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-orgd8088c5" class="outline-4">
<h4 id="orgd8088c5"><span class="section-number-4">14.1.4.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
<div id="outline-container-org610dbe6" class="outline-4">
<h4 id="org610dbe6"><span class="section-number-4">14.1.5.</span> u3scpi 'DIGITIZER' subsystem.</h4>
</div>
</div>
</div>

<div id="outline-container-orgf4408a6" class="outline-2">
<h2 id="orgf4408a6"><span class="section-number-2">15.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-15">
<p>
Maybe this can be simplified to just the GPS module in 'tracking' mode
(which gets carried around), and a separate docking module to extract
the data.
</p>
</div>
<div id="outline-container-org6fa1149" class="outline-3">
<h3 id="org6fa1149"><span class="section-number-3">15.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-15-1">
</div>
<div id="outline-container-org023632f" class="outline-4">
<h4 id="org023632f"><span class="section-number-4">15.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-orga3c37fe" class="outline-4">
<h4 id="orga3c37fe"><span class="section-number-4">15.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org974fc0f" class="outline-4">
<h4 id="org974fc0f"><span class="section-number-4">15.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-org0e3adb1" class="outline-2">
<h2 id="org0e3adb1"><span class="section-number-2">16.</span> wktcolor</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orga2694c0" class="outline-3">
<h3 id="orga2694c0"><span class="section-number-3">16.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-16-1">
</div>
<div id="outline-container-org1390c65" class="outline-4">
<h4 id="org1390c65"><span class="section-number-4">16.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-16-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org9447e22" class="outline-2">
<h2 id="org9447e22"><span class="section-number-2">17.</span> wktplot</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orgbd31bda" class="outline-3">
<h3 id="orgbd31bda"><span class="section-number-3">17.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-17-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-orgf1a7093" class="outline-2">
<h2 id="orgf1a7093"><span class="section-number-2">18.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org0fd0a5b" class="outline-3">
<h3 id="org0fd0a5b"><span class="section-number-3">18.1.</span> Next step</h3>
<div class="outline-text-3" id="text-18-1">
</div>
<div id="outline-container-orgd8e136f" class="outline-4">
<h4 id="orgd8e136f"><span class="section-number-4">18.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-orgadf07f0" class="outline-2">
<h2 id="orgadf07f0"><span class="section-number-2">19.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-orga26d264" class="outline-3">
<h3 id="orga26d264"><span class="section-number-3">19.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-19-1">
</div>
<div id="outline-container-orgcbd04ad" class="outline-4">
<h4 id="orgcbd04ad"><span class="section-number-4">19.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-orgffe5c45" class="outline-2">
<h2 id="orgffe5c45"><span class="section-number-2">20.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-orgde4270d" class="outline-3">
<h3 id="orgde4270d"><span class="section-number-3">20.1.</span> Need to think about adding floating point support</h3>
</div>
<div id="outline-container-org22fb215" class="outline-3">
<h3 id="org22fb215"><span class="section-number-3">20.2.</span> Port to non-Linux OS</h3>
</div>
</div>
<div id="outline-container-orge425cd4" class="outline-2">
<h2 id="orge425cd4"><span class="section-number-2">21.</span> Swocer</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-orgd9980fa" class="outline-3">
<h3 id="orgd9980fa"><span class="section-number-3">21.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-21-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-org5028227" class="outline-3">
<h3 id="org5028227"><span class="section-number-3">21.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-21-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-orgdd819a7" class="outline-3">
<h3 id="orgdd819a7"><span class="section-number-3">21.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-21-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>